# GroupSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupSet Constructor
GroupSet Class See Also
---
Initializes a new instance of the GroupSet class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GroupSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
GroupSet()
```

# See Also
GroupSet Class
Autodesk.Revit.DB Namespace